In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("iris.csv")

In [3]:
df.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width   Class
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [7]:
df["Class"]

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: Class, Length: 150, dtype: object

In [8]:
df.Class

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: Class, Length: 150, dtype: object

In [9]:
df_class = df["Class"]

In [10]:
df_class.head()

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: Class, dtype: object

In [11]:
df_class.tail()

145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: Class, dtype: object

In [12]:
df[["Petal_Width", "Class"]]

     Petal_Width      Class
0            0.2     Setosa
1            0.2     Setosa
2            0.2     Setosa
3            0.2     Setosa
4            0.2     Setosa
..           ...        ...
145          2.3  Virginica
146          1.9  Virginica
147          2.0  Virginica
148          2.3  Virginica
149          1.8  Virginica

[150 rows x 2 columns]

In [14]:
df_new = df[["Petal_Width", "Class"]]

In [15]:
df_new.head()

   Petal_Width   Class
0          0.2  Setosa
1          0.2  Setosa
2          0.2  Setosa
3          0.2  Setosa
4          0.2  Setosa

In [16]:
df_new.tail()

     Petal_Width      Class
145          2.3  Virginica
146          1.9  Virginica
147          2.0  Virginica
148          2.3  Virginica
149          1.8  Virginica

In [17]:
df[["Petal_Length","Petal_Width", "Class"]]

     Petal_Length  Petal_Width      Class
0             1.4          0.2     Setosa
1             1.4          0.2     Setosa
2             1.3          0.2     Setosa
3             1.5          0.2     Setosa
4             1.4          0.2     Setosa
..            ...          ...        ...
145           5.2          2.3  Virginica
146           5.0          1.9  Virginica
147           5.2          2.0  Virginica
148           5.4          2.3  Virginica
149           5.1          1.8  Virginica

[150 rows x 3 columns]